import math

t1 = 200
t2 = 2000
t3 = 20000
a0 = 0.07
k = 0.4

f1 = a0 * k * t1 ** (k - 1) * math.e ** (-a0 * t1 ** k)
f2 = a0 * k * t2 ** (k - 1) * math.e ** (-a0 * t2 ** k)
f3 = a0 * k * t3 ** (k - 1) * math.e ** (-a0 * t3 ** k)

a1 = (k / a0) * (t1 / a0) ** (k-1)
a2 = (k / a0) * (t2 / a0) ** (k-1)
a3 = (k / a0) * (t3 / a0) ** (k-1)

T = math.gamma(1/k + 1) / (a0 ** (1 / k))

print(f"Частота отказов f(d) при t = {t1}: {f1}")
print(f"Частота отказов f(d) при t = {t2}: {f2}")
print(f"Частота отказов f(d) при t = {t3}: {f3}")

print(f"Интенсивность отказов при t = {t1}: {a1}")
print(f"Интенсивность отказов при t = {t2}: {a2}")
print(f"Интенсивность отказов при t = {t3}: {a3}")

print(F"Средняя наработка до отката: {T}")